In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {"A":[1,2,3,np.nan,np.nan],"B":[2,6,2,6,np.nan], "C":[np.nan,5,7,3,7], "D":[1,2,3,4,5]}
df = pd.DataFrame(d,(1,2,3,4,5))
df

     A    B    C  D
1  1.0  2.0  NaN  1
2  2.0  6.0  5.0  2
3  3.0  2.0  7.0  3
4  NaN  6.0  3.0  4
5  NaN  NaN  7.0  5

In [3]:
df.dropna()

     A    B    C  D
2  2.0  6.0  5.0  2
3  3.0  2.0  7.0  3

In [4]:
df.dropna(axis = 0)

     A    B    C  D
2  2.0  6.0  5.0  2
3  3.0  2.0  7.0  3

In [7]:
df["A"].fillna( value = df["A"].mean(), inplace = True)
df["B"].fillna( value = df["B"].min(), inplace = True)
df["C"].fillna( value = df["C"].max(), inplace = True)
df

     A    B    C  D
1  1.0  2.0  3.0  1
2  2.0  6.0  5.0  2
3  3.0  2.0  7.0  3
4  2.0  6.0  3.0  4
5  2.0  2.0  7.0  5